covidYear 858723
mask 620081
pandemic 561219
coronavirus 515194
people 446283
COVID 397997
wear 367623
covid 341668
Trump 328305
cases 291760
masks 273597
amp 263102
like 262159
virus 254594
Covid 253054
new 242310
wearing 241123
#COVID19 238365
dont 229516
000 216184
get 215305
positive 208054
one 205694
schools 192902
Coronavirus 189931
lockdown 187301
Im 185930
COVID19 168528
cant 165169
time 164544
19 164209
deaths 159586
us 156425
tested 148898
US 146468
quarantine 145770
would 143911
day 143369
going 141085
face 139629
go 134549
New 133935
think 131086
need 127473
still 126034
Florida 125459
know 123131
back 122355
home 121839
today 119930
health 118931
school 117895
even 117664
news 117252
reopen 116796
want 115829
social 112607
months 107093
public 104683
vaccine 104206
said 103995
work 103215
country 101260
days 100942
see 100621
corona 99932
says 99775
make 99155
say 97863
data 96107
President 94584
world 93606
many 93344
died 93135
got 92793
could 92205
CDC 91874
first 90814
every 90500
right 90252
10 89755
distancing 89284
2020 87374
due 87373
Americans 84855
take 84183
The 84156
really 84132
kids 83576
testing 83552
since 83487
way 83466
good 82622
help 82559
test 82100
spread 79648
students 79359
never 79010
death 78589
government 78225
2.02K 77764
much 77517
reopening 76568
Please 76478
BREAKING 75693
state 75485
last 75407
life 75385
everyone 75113
safe 74451
getting 72810
in 71616
care 71357
years 71121
to 71066
trump 70966
patients 69881
15 69859
Dr 69741
children 69382
year 69255
stop 68840
doesnt 68703
Health 68539
@realDonaldTrump 68371
weeks 68226
#coronavirus 67786
also 67679
Wear 66916
America 66192
lives 65548
Corona 65281
stay 64965
didnt 63313
week 63280
control 63125
and 62569
may 61791
response 61756
July 61586
made 61100
White 60956
without 60666
China 60440
ever 60358
well 60262
House 60136
isnt 59412
family 59397
please 59333
York 59322
wont 59200
thing 59105
via 58228
working 58097
hospital 57898
Trumps 57619
number 57599
around 57575
07 57339
rate 56910
of 56705
11 56541
Fauci 56128
keep 55890
must 55837
two 55709
News 55098
tests 55049
youre 54239
Ive 54032
look 53954
trying 53721
put 52586
states 52298
Disney 52266
World 51746
Pandemic 50647
open 50255
ago 49894
away 49484
die 49230
come 49201
crisis 48800
reported 48592
already 48483
numbers 48419
lost 48034
American 47708
president 47635
real 47495
man 47345
risk 47319
20 46951
better 46744
economic 46723
for 46468
tell 46181
job 45954
Texas 45913
told 45858
countries 45516
Year 45407
went 45322
money 44963
start 44641
STOP 44633
Donald 44569
live 44549
UK 44265
workers 44148
best 44127
next 43703
give 43632
use 43229
long 43218
Gov 42928
case 42902
someone 42840
support 42768
100 42368
person 42288
People 41994
full 41939
the 41916
PPE 41906
yall 41543
hours 41431
media 41415
States 41402
believe 41331
United 41225
Virus 41039
let 41004
understand 40913
Dont 40777
done 40495
story 40483
less 40462
another 40075
actually 39953
things 39925
12 39905
30 39646
Mask 39453
Governor 39345
hard 39338
plan 39297
nothing 39205
fight 39178
saying 39114
hope 38978
hospitals 38680
end 38671
dead 38618
report 38541
FORCING 38495
hes 38237
MASK 38157
enough 37977
month 37948
teachers 37939
political 37869
times 37654
bad 37585
anyone 37573
thats 37500
theyre 37441
economy 37305
TRUMP 37195
Masks 36963
hands 36915
India 36896
find 36875
friends 36769
Thats 36698
middle 36681
yet 36341
business 36262
save 36197
high 36164
free 35982
yesterday 35946
global 35713
science 35702
great 35623
WEAR 35616
mandatory 35481
infected 35308
whole 35301
others 35275
part 35265
Schools 35218
love 35098
fact 35030
thought 34943
Lockdown 34898
24 34821
sick 34749
feel 34607
making 34421
sure 34189
daily 34109
soon 34059
County 34045
300 34032
protect 33985
needs 33927
lot 33903
called 33895
gonna 33797
clear 33756
Chinese 33720
March 33689
early 33687
staff 33628
something 33388
police 33381
results 32935
per 32919
old 32844
wave 32677
One 32645
single 32461
is 32399
Face 32398
second 32348
Wearing 32315
used 32235
State 32160
Twitter 32156
shut 32149
record 32124
cover 32019
left 32007
#covid19 31987
coming 31844
study 31828
14 31776
force 31676
fucking 31583
taking 31496
wrong 31363
deadly 31071
worse 31024
literally 30979
took 30835
confirmed 30795
least 30610
always 30450
2 30290
medical 30256
total 29984
wants 29693
makes 29578
watch 29472
unemployment 29433
pay 29393
instead 29386
South 29353
local 29317
reason 29197
read 29184
show 29179
Lets 29105
theres 28915
house 28891
big 28674
ANOTHER 28524
THE 28509
national 28426
community 28313
killed 28233
child 28177
DATA 28002
far 27792
seen 27753
GO 27715
hit 27598
Paul 27549
13 27492
reports 27491
symptoms 27353
shit 27319
cannot 27299
point 27230
THIRD 27176
video 27097
Ill 27074
seems 26803
NEW 26774
came 26771
everything 26767
outbreak 26758
Cases 26666
arent 26637
party 26626
little 26589
doctor 26563
parents 26511
Bill 26335
administration 26266
almost 26248
might 26247
Democrats 26200
Get 26124
election 26109
Thank 26050
Yes 26026
Black 25945
GOP 25864
post 25766
place 25692
found 25675
Government 25671
Hydroxychloroquine 25662
dying 25615
order 25550
online 25481
shows 25468
situation 25434
flu 25385
DONALD 25381
using 25349
trust 25323
18 25306
Biden 25302
close 25240
problem 25183
HOSPITALS 25177
started 25163
hydroxychloroquine 25128
asked 25080
Quarantine 25078
past 25067
finally 25045
important 24973
Hospital 24961
closed 24915
SENDING 24903
call 24857
teacher 24851
God 24798
Georgia 24740
hear 24638
wouldnt 24636
Everyone 24523
hand 24491
Good 24464
Well 24414
infection 24340
anything 24291
@ProjectLincoln 24230
fall 24199
morning 24190
damn 24132
Today 24041
highest 24032
immune 24022
mean 23919
continue 23896
change 23789
top 23781
bit.ly 23733
failed 23605
system 23599
1 23580
across 23480
matter 23448
else 23439
able 23428
4 23403
dangerous 23373
black 23349
article 23292
running 23287
utm_source 23270
Stop 23265
im 23144
latest 23043
Vaccine 23010
Social 22999
Even 22998
officials 22964
LOCKDOWN 22948
student 22927
16 22913
utm_medium 22856
human 22802
store 22684
remember 22621
minutes 22604
recovered 22591
TO 22580
looking 22568
PM 22536
May 22517
hate 22392
team 22391
spreading 22373
stupid 22337
population 22329
handling 22326
safety 22307
vote 22307
worst 22270
exams 22209
Remember 22196
entire 22195
likely 22180
govt 22130
negative 22102
businesses 22016
normal 22016
treatment 22009
homes 21981
food 21963
ask 21957
doctors 21915
forward 21900
talking 21815
giving 21719
run 21680
reporting 21668
Cuomo 21655
happen 21633
together 21594
inside 21588
federal 21559
half 21473
surge 21415
guy 21413
gets 21392
follow 21386
Heres 21370
wait 21315
recovery 21257
telling 21242
relief 21134
kind 21111
on 21084
amid 21068
BLM 21065
Care 21061
july 21033
TIME 20931
3 20908
#COVID 20896
immunity 20889
Due 20883
possible 20869
become 20814
sorry 20792
shouldnt 20761
increase 20670
infections 20661
thousands 20647
experts 20628
Youre 20581
Manafort 20524
Medical 20506
friend 20506
outside 20442
Update 20363
families 20363
lies 20339
survive 20208
ones 20148
City 20077
tweet 20039
following 20018
asking 20005
white 19960
95 19948
cause 19932
girls 19930
kill 19865
send 19853
lets 19848
more 19830
given 19795
heart 19775
restrictions 19766
politics 19627
means 19622
travel 19611
Read 19584
jobs 19564
research 19543
GROCERY 19528
nose 19500
opening 19389
patient 19367
looks 19323
Every 19320
guidelines 19225
recover 19217
First 19162
saw 19127
share 19126
officially 19105
NY 19098
1000 19088
either 19084
comes 19008
08 19002
talk 18992
idea 18950
young 18935
alone 18917
set 18846
5 18820
Also 18806
moving 18791
lead 18733
ICU 18717
wanted 18711
Oh 18692
A 18680
probably 18639
PANIC 18614
including 18606
ass 18585
reading 18574
forget 18545
refuse 18542
whats 18478
Another 18474
Gates 18470
National 18468
thinking 18433
fuck 18428
Japan 18420
hell 18405
three 18394
guys 18385
leadership 18374
nation 18347
August 18336
Hes 18334
fighting 18309
lice 18283
nursing 18229
weve 18212
question 18149
released 18112
disease 18099
try 18082
PANDEMIC 18061
realize 17999
100% 17871
woman 17864
group 17863
prevent 17862
happened 17841
200 17826
starting 17826
knew 17815
Deaths 17778
india 17731
tomorrow 17725
lie 17685
50 17683
currently 17674
fear 17671
500 17660
information 17659
reminder 17616
Republicans 17613
hoax 17597
true 17596
works 17571
distance 17557
miss 17556
fine 17545
sent 17523
completely 17519
millions 17500
especially 17480
evidence 17474
Hey 17470
late 17456
hasnt 17446
longer 17445
Home 17416
military 17304
up 17277
California 17272
city 17269
Breaking 17257
mom 17244
Death 17243
threat 17243
small 17233
USA 17215
lol 17181
visit 17179
sense 17152
Id 17141
members 17139
though 17133
leave 17129
at 17083
DONT 17070
wonder 17070
Arizona 17069
from 17067
seconds 17042
taken 17033
Theres 17025
main 16999
Dear 16960
office 16946
different 16943
with 16913
rules 16909
list 16907
listen 16878
available 16851
cut 16846
passed 16838
bill 16801
employees 16785
seriously 16755
stand 16752
School 16746
Joe 16742
vaccines 16704
campaign 16681
protests 16629
thread 16629
thinks 16616
Public 16612
MAN 16601
WANNA 16586
funding 16578
Minister 16573
dies 16554
Mayor 16552
Testing 16544
major 16527
effective 16511
Great 16509
exposed 16497
University 16493
age 16472
strap 16471
safely 16451
@DWUhlfelderLaw 16447
healthcare 16440
ppl 16402
dealing 16392
exam 16380
seeing 16366
body 16336
havent 16319
serious 16304
tank 16299
issue 16295
treat 16251
era 16227
IS 16219
decided 16183
son 16180
four 16158
summer 16143
@CNN 16123
Govt 16104
living 16082
racist 16078
toll 16051
fully 16024
learn 16017
thank 16003
folks 16001
Says 15952
insane 15895
Lives 15893
impact 15862
fake 15845
whether 15833
17 15828
Positive 15817
gone 15802
play 15799
return 15798
zero 15792
Thanks 15780
policy 15768
contact 15743
losing 15728
#COVID__19 15715
no 15712
rise 15711
update 15678
spaghetti 15668
NEWS 15667
#covid_19 15621
truth 15601
60 15600
mother 15579
everywhere 15572
rather 15564
absolutely 15559
rest 15545
Congress 15540
watching 15532
dlvr.it 15529
based 15494
bro 15486
behind 15460
guidance 15431
Someone 15418
Tuesday 15399
maybe 15394
education 15341
customers 15309
difficult 15225
allowed 15214
forced 15213
killing 15184
scientists 15162
wasnt 15155
leaders 15139
deal 15120
Imagine 15114
spike 15085
drug 15061
Maybe 15030
beginning 14994
alive 14985
governor 14966
youve 14964
Republican 14914
gotten 14904
low 14872
@JoeBiden 14867
NEVER 14813
measures 14793
plans 14765
etc 14763
Walmart 14738
county 14733
prison 14724
break 14713
caught 14665
according 14661
healthy 14640
blame 14618
season 14568
despite 14559
happy 14548
goes 14545
residents 14525
agree 14515
21 14509
five 14480
DeVos 14479
40 14475
proof 14466
course 14461
private 14454
women 14435
lying 14430
vs 14389
utm_campaign 14368
Russia 14360
Let 14359
knows 14346
service 14293
covering 14291
mid 14291
Two 14284
history 14275
million 14274
level 14265
Kemp 14253
Look 14244
reopened 14231
Many 14219
issues 14204
Hi 14186
nearly 14145
pretty 14118
400 14113
ready 14104
25 14089
Like 14083
Canada 14079
To 14076
Times 14050
mandate 14043
bring 14023
among 14007
HCQ 14001
anymore 13964
June 13956
NYC 13949
23 13946
caused 13943
mind 13939
common 13931
current 13927
bc 13918
future 13898
NUMBERS 13885
beds 13885
Reopening 13843
announced 13830
sea 13820
130 13804
depends 13804
Stay 13796
or 13796
ONE 13793
Betsy 13786
america 13754
Make 13751
wow 13748
Day 13739
move 13725
heard 13712
required 13706
AND 13698
result 13671
needed 13668
putting 13626
Since 13624
feet 13553
FL 13545
Center 13542
herd 13517
gas 13507
refused 13501
tax 13501
wore 13498
transmission 13476
cities 13470
war 13467
curve 13458
frontline 13457
biggest 13448
port 13396
classes 13378
solution 13358
trials 13329
blood 13320
air 13307
active 13302
In 13280
press 13256
shot 13253
thanks 13231
night 13196
places 13186
Doctor 13175
Time 13174
decision 13117
line 13112
happening 13111
England 13110
rally 13042
facing 13036
allow 13017
citizens 12984
I 12958
straight 12951
April 12940
imports 12937
wish 12935
higher 12929
yes 12877
Oxford 12837
famine 12826
Ohio 12819
Media 12811
florida 12806
Monday 12803
@drdavidsamadi 12796
Tested 12796
leading 12795
Take 12772
calling 12762
cancelled 12746
choice 12732
takes 12710
Big 12706
calls 12706
ok 12694
forth 12690
feels 12684
Brian 12676
Secretary 12671
cure 12668
22 12653
cancel 12649
count 12638
essential 12612
quick 12612
@kylegriffin1 12606
slow 12596
Grey 12593
guess 12563
Herman 12559
check 12557
CNN 12536
tells 12534
Meredith 12485
reduce 12483
sanitizer 12467
7 12448
Mike 12441
affected 12439
@nyshuffler 12418
pushing 12415
Top 12412
Johnson 12409
DeSantis 12406
SKEW 12404
San 12403
spent 12391
Michael 12367
asymptomatic 12361
wash 12361
ER 12348
Germany 12335
gave 12335
responsible 12335
Hong 12319
related 12315
personal 12312
Blocking 12305
meeting 12272
company 12269
bringing 12256
8 12247
Sir 12234
hundreds 12233
advice 12215
EXTREMELY 12213
expected 12207
Shes 12200
NBC 12199
@KyleKulinski 12188
1.0K 12179
huge 12174
has 12170
buy 12132
law 12119
Education 12104
sending 12093
continues 12090
rates 12088
provide 12041
room 12032
side 11980
failure 11969
simply 11968
girl 11966
baby 11965
have 11965
ways 11958
wife 11947
name 11928
recorded 11915
game 11914
waiting 11909
2nd 11902
GOD 11902
Man 11864
Listen 11851
push 11840
couldnt 11800
power 11797
smart 11786
september 11785
message 11769
missed 11749
demand 11731
lack 11710
head 11695
admitted 11686
600 11685
EMPLOYEE 11684
are 11683
hurt 11670
70 11628
Happy 11620
chance 11613
TV 11591
Children 11578
Total 11566
Cain 11555
as 11551
twitter 11549
worked 11544
aid 11517
Office 11505
action 11497
sir 11488
Data 11477
Mr 11476
nationwide 11476
20s 11458
paid 11445
Check 11439
changed 11425
expert 11405
require 11403
music 11389
Kong 11375
Reopen 11357
worth 11340
class 11338
sign 11337
34 11329
selling 11320
increasing 11295
crazy 11291
sad 11282
updates 11275
130000 11259
Teachers 11241
tracing 11205
discuss 11183
large 11181
changes 11176
leader 11171
mental 11170
pass 11138
Weve 11128
Delhi 11087
4th 11069
Would 11034
hold 11027
November 11012
earlier 11007
waste 11002
cousin 11000
Watch 10991
massive 10982
hearing 10978
rising 10975
26 10943
Nobody 10937
WE 10933
East 10919
companies 10918
emergency 10913
SHUT 10910
Police 10895
Facebook 10882
example 10876
price 10867
Keep 10853
Lodge 10821
received 10811
learned 10810
Walt 10794
STORE 10778
access 10769
experience 10755
conditions 10750
Friday 10726
act 10721
plus 10709
stuff 10709
along 10700
SMALL 10685
Boris 10679
OH 10676
gotta 10675
claims 10673
Test 10667
hour 10666
correctly 10665
LOL 10631
55 10622
ASKED 10612
Theyre 10609
Whats 10605
within 10595
strategy 10592
TOWN 10552
Never 10543
orders 10524
Cant 10515
official 10507
SEE 10491
reality 10488
poor 10481
Students 10478
Oval 10477
WALKED 10471
later 10452
youtu.be 10438
join 10404
former 10398
Still 10393
understanding 10382
damage 10359
6 10339
easy 10336
several 10327
short 10323
china 10317
freedom 10306
false 10288
moment 10287
pray 10285
Go 10275
Remdesivir 10262
catch 10261
bit 10259
refusing 10258
twice 10249
wake 10231
CORONAVIRUS 10230
complaining 10224
weekend 10221
dad 10215
learning 10211
Europe 10209
players 10207
Department 10197
allergies 10166
till 10148
facts 10146
wanna 10142
not 10137
after 10134
questions 10085
Meanwhile 10083
trial 10073
battle 10067
Doctors 10066
credit 10064
protest 10059
key 10044
stores 10044
contract 10035
Africa 10031
worlds 10022
avoid 10020
capacity 10019
suggest 10009
source 9999
Could 9996
area 9996
Russian 9995
Despite 9993
quarantined 9991
effects 9979
Former 9973
governments 9973
theguardian.com 9960
critical 9952
brought 9946
Sunday 9945
ventilators 9944
viral 9943
shops 9939
BBC 9937
release 9923
amount 9922
known 9920
claim 9919
enforce 9915
See 9914
speak 9897
simple 9896
joke 9891
six 9891
period 9887
MASKS 9884
isolation 9877
Press 9866
Commissioner 9865
remain 9865
Tulsa 9860
Report 9854
Matt 9848
expect 9836
cost 9834
narrative 9834
seem 9829
lower 9804
REPORT 9793
Washington 9782
thoughts 9778
Need 9769
win 9761
developed 9760
luck 9755
@itsJeffTiedrich 9747
complete 9732
beat 9728
keeping 9725
hot 9716
ow.ly 9696
rights 9687
supposed 9679
mass 9677
Hospitals 9676
trib.al 9657
NHS 9643
45 9638
decisions 9630
65 9620
Wheres 9615
coverings 9615
recent 9606
tear 9602
words 9593
showing 9569
anxiety 9564
Zealand 9561
BJP 9554
Wow 9533
Church 9529
Scotland 9527
Yeah 9526
photo 9521
playing 9519
System 9514
CORONA 9504
#trumpvirus 9493
argument 9488
Kiss 9474
brain 9474
crime 9469
attack 9463
financial 9463
@ASlavitt 9452
fun 9447
CLOSE 9442
front 9429
vulnerable 9421
#staysafe 9416
DC 9403
15300 9395
John 9351
North 9348
acting 9337
sports 9330
planning 9309
32 9303
aint 9301
lose 9300
Interesting 9288
helping 9287
event 9286
DISEASE 9284
80 9283
restaurant 9283
remove 9282
exist 9279
explain 9270
CASES 9265
word 9256
jail 9253
CONTROL 9252
treated 9250
If 9247
Tell 9241
cough 9237
reach 9229
busy 9226
Pence 9218
STORES 9205
problems 9189
unless 9188
Oklahoma 9177
cancer 9174
loss 9172
step 9163
Love 9154
wears 9151
shop 9148
amazing 9147
account 9139
INTO 9128
135 9116
march 9105
feeling 9101
funds 9097
Fuck 9096
breaking 9091
focus 9079
Thursday 9075
breathe 9069
Chris 9057
Sweden 9054
Obama 9053
Global 9051
@AliciaForina 9049
Fox 9013
nurses 9012
capitalism 9000
#lockdown 8999
chief 8997
Left 8993
link 8987
ahead 8983
Chief 8981
COVID__19 8979
largest 8973
restaurants 8972
SARSCoV2 8965
Last 8962
voting 8957
loved 8945
sleep 8942
Wednesday 8920
Especially 8917
stimulus 8917
general 8915
nobody 8910
piece 8907
strong 8902
@tedlieu 8901
PLEASE 8897
1st 8887
jul 8887
turn 8884
water 8883
budget 8881
created 8877
midst 8877
banned 8874
became 8869
song 8852
Administration 8850
Post 8832
West 8831
happens 8825
held 8820
king 8812
dollars 8810
meet 8804
charge 8791
Yet 8787
strike 8784
suffering 8770
Working 8763
security 8760
exactly 8730
climate 8727
efforts 8724
Australia 8714
vehicles 8709
lied 8705
led 8700
answer 8698
Andrew 8697
Antonio 8694
ensure 8694
#wearamask 8691
forcing 8690
bed 8684
bars 8677
totally 8672
Saturday 8662
Right 8639
Study 8635
package 8635
werent 8631
services 8617
studies 8609
Daily 8608
35 8605
car 8598
@DrEricDing 8581
brother 8579
uk 8577
football 8572
theyve 8567
met 8556
N95 8553
retweet 8553
self 8536
worried 8532
wouldve 8521
57 8519
WORLD 8518
tired 8514
market 8513
somehow 8511
concerns 8506
@thehill 8503
ICE 8503
tried 8502
proper 8499
Live 8496
LIVES 8486
imagine 8479
actual 8473
sit 8468
Kids 8464
industry 8460
Control 8452
potential 8449
47 8432
third 8431
disposable 8425
truly 8421
manager 8420
anywhere 8404
idiots 8398
Catholic 8391
measure 8383
Los 8376
decide 8365
opportunity 8363
85 8362
fashion 8353
worry 8341
VIRUS 8339
spend 8338
Join 8332
Science 8323
heroes 8322
episode 8321
interview 8306
Ford 8296
racism 8295
shutdown 8284
throat 8282
counties 8270
Gilead 8269
Hope 8248
extra 8247
often 8237
lockdowns 8230
Yall 8221
helped 8218
tonight 8217
stopped 8214
father 8210
will 8205
Instead 8196
mild 8194
respect 8190
Wait 8179
married 8179
Cohen 8177
basically 8173
@Acosta 8170
claiming 8170
interesting 8166
kept 8166
idiot 8164
responsibility 8164
special 8162
near 8153
leaving 8152
protecting 8148
fire 8141
28 8136
weather 8131
#covid 8126
Back 8126
mandates 8126
okay 8123
dumb 8115
mine 8115
misinformation 8108
shirt 8101
Indian 8095
kid 8095
@TomFitton 8085
daughter 8080
perfect 8077
awful 8071
peoples 8069
31 8064
Anyone 8064
Of 8062
communities 8055
governors 8055
beatings 8050
Watching 8046
@RBReich 8043
@ProjectJosiee 8023
border 8018
create 8018
blue 8016
cops 8008
London 8004
street 8001
regarding 7988
opinion 7985
challenges 7981
politicians 7976
remote 7959
elderly 7957
05 7949
fights 7947
@WHO 7945
Millions 7945
Anthony 7943
beyond 7939
adults 7934
men 7933
address 7930
According 7929
recently 7926
nice 7906
#pandemic 7887
necessary 7884
perspective 7881
podcast 7878
shes 7878
clinic 7877
Risk 7875
54 7872
Help 7864
48 7858
space 7857
published 7856
singleday 7849
warned 7846
benefits 7844
De 7840
debate 7838
choose 7829
began 7823
definitely 7823
Task 7820
antibodies 7820
@WhiteHouse 7814
Ron 7814
couple 7810
concerned 7807
shown 7806
walk 7806
society 7803
ur 7803
afraid 7797
conduct 7792
challenge 7781
requiring 7771
Flu 7759
app 7758
PEOPLE 7749
idk 7737
hug 7734
everyday 7730
paying 7714
trafficking 7708
On 7707
Democrat 7698
increased 7693
corruption 7691
Dems 7689
Reed 7686
Senate 7684
Court 7679
27 7678
WH 7677
mouth 7669
soldiers 7669
college 7660
43 7652
reporter 7652
eat 7647
Birx 7645
@NYGovCuomo 7642
saved 7641
nations 7631
shake 7628
29 7627
CMP 7614
@mitchellvii 7611
records 7602
proud 7594
approach 7589
building 7589
info 7586
harder 7572
tiger 7572
deemed 7564
poll 7561
areas 7560
customer 7543
Life 7542
levels 7540
Bachchan 7537
effect 7537
novel 7532
For 7521
difference 7519
gloves 7516
kills 7501
Tests 7498
red 7493
rent 7491
paper 7486
@priteshgandhimd 7480
talked 7479
consider 7472
physical 7465
Mickey 7463
shame 7463
Director 7461
date 7453
term 7448
Party 7438
out 7434
forever 7430
#echobox 7420
echobox 7420
breaks 7419
missing 7406
refuses 7406
Austin 7405
posted 7400
Wuhan 7396
rule 7396
hitting 7391
@MSNBC 7377
we 7373
ongoing 7367
statement 7366
selfish 7364
t. 7364
2.021K 7359
Rate 7359
worker 7347
unemployed 7344
Work 7330
hospitalized 7326
Really 7325
mortality 7322
Chuck 7308
Earth 7308
stage 7308
project 7306
Relief 7304
be 7304
youll 7291
Years 7289
phase 7288
supplies 7282
protection 7281
3rd 7280
flight 7280
broken 7279
Houston 7278
ordered 7278
light 7249
AP 7242
releases 7236
298 7228
stories 7225
fraud 7212
convention 7199
pm 7198
disgusting 7195
Sydmar 7192
attention 7189
Italy 7185
effort 7170
obvious 7167
ill 7166
Show 7158
authorities 7158
abuse 7154
task 7151
@BrandonHonaker1 7149
attending 7149
struggling 7149
pick 7144
90% 7141
Americas 7141
super 7134
140 7118
@jsolomonReports 7111
Experts 7110
TEXAS 7104
drop 7101
scared 7093
Brazil 7091
McConnell 7090
fit 7083
Kevin 7081
tomb 7077
eating 7076
trillion 7074
raider 7067
prisoners 7064
book 7062
fund 7062
00 7061
district 7057
certain 7055
extremely 7055
2.019K 7053
Newsom 7053
figure 7052
NBA 7051
antibody 7048
Centers 7045
mention 7045
except 7039
average 7036
precautions 7028
en 7026
birthday 7019
fans 7019
infants 7016
Going 7011
Disease 7004
DEATHS 7001
hotel 6996
lip 6990
IM 6989
supply 6988
scream 6983
Jair 6981
After 6980
Angela 6977
Response 6976
reached 6975
disaster 6973
fast 6965
all 6964
holding 6943
handle 6937
Guest 6933
hospitalizations 6931
fired 6924
ridiculous 6922
cold 6920
taught 6907
Robert 6904
@YouTube 6900
member 6898
Wash 6879
union 6879
facilities 6876
heres 6870
Second 6865
whos 6865
experiences 6864
de 6860
pushed 6860
properly 6853
labs 6852
protocols 6850
@JasmineLWatkins 6848
Tory 6845
HOURS 6839
LA 6838
severe 6835
quickly 6832
stunt 6831
February 6817
clinical 6813
donate 6810
Floridas 6807
texas 6807
shopping 6805
handled 6800
struggle 6799
director 6794
@Reuters 6784
regulate 6782
appears 6764
multiple 6764
Fake 6738
Force 6730
Yesterdays 6724
CEO 6718
now 6696
ban 6693
final 6689
gives 6689
opened 6686
FYI 6685
General 6685
quite 6680
throughout 6673
caseworker 6671
Nearly 6661
@2STEPNEV 6659
additional 6653
over 6648
plasma 6643
by 6642
EU 6638
sitting 6636
removed 6626
@mmpadellan 6620
fauci 6615
@nytimes 6610
develop 6609
scientific 6608
55442 6606
NOT 6601
block 6599
resources 6597
stock 6594
reasons 6592
#BREAKING 6583
write 6576
Got 6572
passing 6570
Mexico 6568
website 6567
bullshit 6562
role 6561
groups 6560
books 6550
weight 6549
QUARANTINE 6547
accept 6545
articles 6540
bubble 6540
100000 6535
documents 6535
involved 6533
husband 6531
tampons 6528
helps 6522
@poregan 6517
goals 6511
covers 6510
Angeles 6505
condition 6505
fresh 6505
Yesterday 6503
gloss 6500
Cummings 6493
drive 6490
outbreaks 6488
Kamala 6477
cnn.com 6477
nurse 6467
Free 6465
played 6463
points 6462
staying 6461
finds 6451
experiencing 6446
REAL 6445
you 6444
MINS 6440
older 6437
Patients 6434
Spain 6431
warning 6428
Roman 6425
logic 6425
willing 6425
track 6423
tough 6412
sacrifice 6411
positivity 6408
f*****g 6399
site 6399
Federal 6387
request 6386
majority 6385
@ChuckCallesto 6378
JUST 6375
@Cleavon_MD 6373
who 6371
Approved 6358
insurance 6357
Numbers 6353
easily 6350
god 6348
minute 6343
signs 6335
model 6333
offer 6330
Karen 6327
@dbongino 6323
disappear 6318
pool 6318
St 6316
Matter 6314
TRUTH 6314
rich 6311
clearly 6309
policies 6300
FUCKING 6297
Yang 6296
75 6292
Walter 6291
matters 6290
serving 6290
whose 6289
voters 6286
sexual 6283
@meigixo 6281
@narendramodi 6281
driving 6274
games 6274
parties 6274
afford 6266
sex 6265
Distancing 6260
was 6259
Trump’s 6258
oh 6255
add 6252
international 6248
@DrRPNishank 6240
Ted 6237
Cristina 6232
@KILLBILLEVOL1 6231
flatten 6225
contracted 6224
view 6220
15th 6219
closing 6217
voice 6208
immediately 6207
epicenter 6206
agenda 6205
eyes 6204
Pelosi 6202
serve 6201
@Katlyn_Marie06 6198
warns 6198
directly 6194
practice 6192
grocery 6191
briefing 6186
dude 6185
position 6184
Democratic 6183
Claims 6179
walking 6176
contain 6175
Amid 6168
EXCLUSIVE 6168
indoor 6165
Million 6163
Street 6159
Best 6154
College 6152
cloth 6150
begin 6147
salaries 6144
baseball 6135
your 6131
excuse 6130
underlying 6130
updated 6129
CM 6128
airborne 6126
Hello 6120
bar 6116
assault 6112
hits 6101
treating 6098
tourists 6095
production 6090
boy 6082
minister 6081
keeps 6078
Next 6074
Nothing 6074
September 6067
skin 6067
album 6060
Say 6059
utm_term 6058
felt 6057
Yale 6056
announces 6051
Michigan 6040
150 6034
Mumbai 6034
@PMOIndia 6031
Rivera 6030
phone 6024
mail 6015
enter 6011
spending 6010
featured 6009
added 6007
manufacturer 6005
thru 6002
empty 6000
Victoria 5997
review 5993
VIDEO 5989
obama 5989
puzzled 5987
growing 5981
January 5977
Beijing 5973
Bow 5961
movie 5960
Finally 5951
t.c 5945
tyranny 5936
Spread 5933
checks 5933
Sign 5929
delivery 5926
raise 5926
Almost 5923
@Anthony_HVTCH 5919
Kneel 5916
Supreme 5913
steps 5912
Stitt 5908
9 5902
Reply 5895
High 5889
blaming 5887
# 5886
cares 5885
Melbourne 5884
Three 5883
Tom 5882
comments 5881
broke 5880
lakh 5880
Karnataka 5876
lucky 5876
direction 5868
STILL 5867
forgot 5867
suggests 5865
sneeze 5857
strict 5856
Henry 5854
Bihar 5849
hems 5847
videos 5847
pro 5846
todays 5846
@CDCgov 5843
confirms 5841
Royal 5839
adjudicate 5839
turned 5839
center 5838
incompetence 5836
RT 5834
applying 5827
reveals 5826
steal 5825
@joshgad 5824
FDA 5817
this 5817
sharing 5813
@sarahcpr 5812
humans 5809
towards 5803
race 5798
#stayhome 5795
animators 5794
Making 5792
UGC 5787
Cure 5782
trap 5782
boys 5780
conspiracy 5780
Vote 5778
@RealJamesWoods 5775
@HKrassenstein 5772
ift.tt 5768
@GovRonDeSantis 5764
Indias 5758
Doesnt 5754
correct 5754
picture 5749
letting 5748
guard 5744
WATCH 5739
Stone 5737
prepared 5736
epidemic 5735
doses 5732
theyll 5724
prayers 5722
tweets 5715
movies 5707
UPDATE 5706
Standing 5703
African 5701
honestly 5701
absolute 5696
worldwide 5696
Atlanta 5693
terrible 5688
apart 5686
postpone 5676
deep 5674
hair 5669
justice 5668
virtual 5666
digital 5662
ignore 5662
type 5661
POTUS 5660
campus 5659
counting 5657
delivered 5657
glad 5655
attacks 5652
successful 5651
#trump 5650
random 5647
double 5641
06 5636
pressure 5631
Nigeria 5627
More 5626
classroom 5622
stress 5619
heat 5618
COVIDfree 5610
Scientists 5608
homeless 5608
Video 5606
victims 5604
Sorry 5603
Zero 5601
GA 5598
Naya 5595
137 5593
conference 5589
lawsuit 5588
Bored 5587
Prime 5585
program 5581
carry 5580
#1 5578
growth 5577
beautiful 5575
shower 5574
begging 5572
Senator 5567
arrested 5567
cool 5565
corrupt 5560
ignoring 5558
hiding 5550
Gavin 5544
trumps 5539
Taiwan 5536
Business 5535
town 5525
10M 5522
useless 5517
when 5515
@GOP 5508
WAS 5507
resign 5506
whatever 5506
Must 5502
smell 5478
virologist 5478
wrote 5476
homeschooling 5473
Want 5471
employee 5471
income 5470
spaces 5468
risks 5465
1.918K 5464
faces 5464
setting 5464
contracts 5461
showed 5459
Is 5453
@bocxtop 5452
include 5450
sees 5448
shield 5448
POSITIVE 5446
viruses 5442
Hancock 5441
dozen 5437
shared 5433
Rep 5426
Korea 5424
teens 5424
selfcare 5423
@donwinslow 5414
ignored 5413
spreads 5411
focused 5399
clean 5398
And 5394
@NBCNews 5393
Are 5386
European 5385
Hard 5384
lab 5384
providing 5384
Carolina 5383
Without 5380
lines 5375
ONTARIO 5374
holiday 5374
Nick 5372
plague 5369
postponed 5365
Think 5364
causes 5363
Governors 5360
crowded 5360
supporting 5356
Give 5351
speedy 5349
posting 5345
systems 5345
deserve 5344
costs 5343
coverup 5343
LIVE 5342
10000 5336
solely 5333
south 5332
propaganda 5329
Died 5328
possibly 5321
BLACK 5320
CA 5319
diagnosed 5319
danger 5316
officer 5314
lipgloss 5313
Todays 5307
Rand 5302
concern 5301
Amitabh 5299
shifted 5296
TX 5295
stats 5295
Miami 5293
basic 5292
Merkel 5290
cuz 5285
everybody 5280
catching 5278
funny 5278
panic 5274
ASSAULTED 5271
details 5269
Money 5268
anti 5268
writing 5268
it 5263
yeah 5258
standing 5256
@Cate__Johnson 5255
how 5253
bachchan 5252
FLED 5239
bigger 5236
spikes 5236
worn 5236
during 5231
Early 5230
training 5230
anyway 5229
gov 5228
@Thomas1774Paine 5226
Parents 5225
Phase 5223
hide 5220
infectious 5220
endangering 5213
meant 5206
supporters 5202
bet 5200
development 5197
upon 5196
non 5195
@spectatorindex 5194
sentence 5194
enjoy 5191
church 5185
impacted 5182
criminal 5180
@ABC 5178
British 5174
tech 5173
Philippines 5172
Learn 5168
schoolsreopening 5168
mad 5166
chin 5165
mark 5165
peak 5165
50% 5163
aware 5162
demanding 5160
events 5159
bus 5157
Use 5150
pls 5146
mayor 5142
Congressman 5140
Radical 5138
defeat 5138
lady 5136
VACCINE 5135
Reporting 5134
Starting 5134
admit 5133
agrees 5132
greater 5130
surprised 5130
recession 5129
theory 5129
breath 5128
72 5125
@asap_locky 5121
figures 5120
womens 5120
Bolsonaro 5118
Roger 5109
club 5108
HHS 5106
illegal 5106
becoming 5102
athletes 5100
fair 5100
rerouted 5100
delay 5099
@aubrey_huff 5096
Follow 5094
process 5093
@QuecianaWalton 5089
NO 5089
yemen 5088
@EBOYJOTARO 5087
Thread 5087
yo 5084
15000 5083
@IngrahamAngle 5079
remains 5079
David 5078
Market 5078
michelle 5068
blog 5065
Union 5061
ya 5061
MATTER 5057
prove 5057
streets 5055
bout 5054
#corona 5042
hero 5042
09 5040
@AOC 5039
France 5034
mess 5029
Save 5027
receive 5027
finding 5022
optout 5021
poverty 5020
build 5016
AN 5012
listening 5012
temperature 5001
directed 4999
inmates 4998
starts 4998
90 4992
successfully 4992
WOW 4991
destroy 4991
60000 4990
Emergency 4989
@AlexBerenson 4987
ad 4987
success 4986
gt 4983
Retweet 4977
notice 4971
@Spotify 4969
bank 4969
1400 4966
Hand 4963
sites 4958
FACE 4955
Parliament 4950
claimed 4950
note 4945
@michele_norris 4939
250 4932
#michelleobamapodcast 4931
FREE 4925
Find 4924
womanhood 4922
executive 4917
@MicheleObama 4916
Jersey 4915
violence 4909
Country 4908
compared 4907
@funder 4902
breathing 4902
Modi 4900
Research 4898
continued 4898
form 4897
lock 4892
Lol 4891
Major 4891
@POTUS 4890
@atensnut 4890
unfair 4886
believes 4884
5th 4881
announce 4881
buff.ly 4880
illness 4880
MAGA 4878
oxygen 4876
Israel 4875
medicine 4867
sport 4861
weird 4861
promote 4860
sound 4860
childrens 4858
voted 4850
Staff 4846
apply 4846
consequences 4842
highly 4841
individuals 4841
touch 4837
map 4835
ends 4831
washing 4831
WEARING 4824
doubt 4824
ji 4820
prior 4820
3M 4817
recoveries 4817
dark 4815
respond 4814
ICYMI 4813
mistake 4809
George 4808
Pres 4808
fucked 4807
conducted 4804
liberals 4801
Stephen 4797
reut.rs 4794
@washingtonpost 4793
admin 4793
70000 4792
indoors 4791
@RexChapman 4790
Autofeed 4790
earth 4788
approved 4787
Real 4784
billionaires 4783
Apparently 4782
linked 4780
Family 4779
locked 4777
MSM 4773
comment 4772
spot 4769
sucked 4767
depression 4765
trip 4761
proven 4758
Portland 4757
Recovery 4757
Unemployment 4753
previous 4752
management 4749
bounties 4746
murder 4746
horrible 4741
parks 4741
returning 4738
reduced 4737
Come 4736
riots 4736
1M 4735
@GavinNewsom 4733
legal 4733
MUST 4729
administrations 4729
written 4724
tstudents 4720
Mississippi 4717
extend 4714
admits 4708
scheme 4708
lots 4705
Canadian 4703
impossible 4703
DOWN 4701
@AP 4700
imposed 4694
Order 4692
evil 4690
No 4689
knowing 4688
Crisis 4687
facility 4682
Old 4679
assistance 4679
bought 4679
taxes 4679
productive 4676
manage 4675
Updates 4674
progress 4674
@SrBachchan 4668
GET 4665
sight 4665
technology 4665
Allergies 4664
babies 4662
2.001K 4658
Mark 4656
From 4651
potentially 4648
stuck 4648
actions 4645
teaching 4638
My 4634
considering 4633
gun 4631
disinformation 4628
statistics 4627
grow 4623
blamed 4621
rooms 4620
survey 4620
becomes 4616
series 4615
survival 4613
Exams 4605
Case 4600
Gove 4597
briefings 4596
host 4596
golf 4594
Perhaps 4592
Blood 4591
candidate 4583
Security 4578
Full 4577
signed 4577
Important 4576
bitch 4574
pain 4573
tips 4573
incompetent 4572
Kennedy 4561
Navajo 4560
presidential 4559
senior 4558
arrest 4557
nytimes.com 4557
corporate 4555
@gatewaypundit 4554
Impact 4554
ABC 4553
asks 4553
@sayabhullar 4552
speaking 4549
Phone 4542
BOMB 4541
hill.cm 4541
Things 4539
why 4536
Nancy 4535
Open 4535
CONFIRMED 4530
#COVID-19 4529
Maharashtra 4528
amongst 4525
stopping 4525
beans 4523
island 4522
protesting 4521
warn 4519
Plasma 4518
attend 4518
centre 4518
size 4518
trend 4518
Ago 4516
inperson 4507
140000 4505
100M 4504
Act 4502
opposed 4502
board 4500
BIG 4498
racial 4498
BS 4492
encourage 4492
HOAX 4489
firm 4486
energy 4485
Woolery 4484
preparing 4484
attempt 4481
saving 4481
@SpeakerPelosi 4476
Store 4472
Actually 4471
Ministry 4471
sell 4471
door 4464
puts 4464
@DKnight10000 4463
contracting 4463
risking 4463
tweeting 4463
webinar 4454
certainly 4453
regular 4451
DAY 4449
allowing 4446
terrifying 4446
managed 4445
teams 4445
@CBSNews 4444
rid 4441
culture 4433
Lmao 4432
buying 4428
surging 4428
environment 4427
tally 4421
fatality 4420
letter 4420
@AkinolaGG 4416
Beach 4416
shift 4416
suit 4409
tshirt 4408
Exactly 4407
Pass 4407
congressmembers 4407
outrageous 4406
fellow 4405
favorite 4404
Raise 4401
infect 4401
CAN 4394
However 4390
troops 4388
Visit 4387
status 4384
bodies 4383
04 4379
followed 4375
upcoming 4374
goal 4373
page 4373
perfectly 4372
Aug 4369
Mitch 4368
Admin 4367
moved 4367
screaming 4367
charges 4366
Soon 4363
ability 4363
coverage 4359
Looking 4354
Ok 4354
@DrDenaGrayson 4353
respiratory 4350
scientist 4348
classic 4347
OF 4346
Interview 4344
Ireland 4337
personally 4334
sales 4333
Ontario 4332
Moderna 4331
@JaniceDean 4330
Military 4330
Wild 4329
investigation 4328
followers 4326
none 4324
conversation 4318
hey 4314
33 4310
sector 4309
virtually 4309
484 4307
americans 4307
ending 4303
fitted 4300
Workers 4299
fears 4298
chinese 4294
Massive 4291
Putin 4290
HELL 4288
officers 4288
terms 4287
Nation 4286
@QueeenAve 4284
secretary 4284
Campaign 4283
570 4281
Central 4281
Record 4280
posts 4275
Protect 4272
limit 4272
offers 4272
stomach 4271
that 4270
attended 4265
mix 4262
Hell 4257
War 4256
joined 4256
stands 4256
flying 4255
attacking 4254
#SARSCoV2 4249
@SethAbramson 4247
significant 4247
drugs 4246
easier 4244
statewide 4244
Call 4238
round 4238
controlled 4231
Human 4228
exposure 4225
judge 4223
similar 4223
aged 4221
content 4221
@cnnbrk 4220
apparently 4220
Sen 4219
accurate 4218
can 4218
*us* 4217
includes 4217
protective 4217
democrats 4216
How 4215
con 4211
NEET 4210
socially 4208
brand 4206
Treatment 4204
nightmare 4204
accuses 4203
cdc 4202
samples 4200
limited 4199
tracking 4198
talks 4195
STAY 4194
Hoax 4193
equipment 4189
provided 4188
billions 4186
1.4 4182
Confirmed 4181
ended 4181
As 4180
Plan 4180
KNOW 4179
scary 4175
fever 4174
reaction 4174
fix 4173
AZ 4172
raging 4171
That 4170
compulsory 4169
headline 4168
crossed 4164
borders 4163
Beirut 4160
Virginia 4159
combined 4159
Suffering 4158
option 4158
welcome 4155
transport 4154
lung 4153
practical 4153
profit 4153
Nye 4150
driver 4150
SA 4148
#socialdistancing 4147
someones 4142
93 4137
Mosby 4136
carers 4133
visiting 4133
MENTIONED 4131
than 4130
Support 4129
Mandatory 4128
cnn.it 4128
internet 4128
@ANI 4126
benefit 4125
dr 4124
Shows 4122
communist 4122
Insider 4120
Fund 4118
pull 4114
@chuckwoolery 4112
Missouri 4109
condoms 4109
COVER 4108
conducting 4108
lmao 4108
DeWine 4107
loses 4107
Justice 4105
mostly 4104
Brexit 4099
bbc.com 4099
Norway 4095
2M 4093
therapist 4093
complications 4092
stems 4090
managing 4088
433 4087
@ewarren 4087
Seriously 4084
Amit 4082
Economic 4082
staysafe 4082
churches 4080
programmed 4079
Healthcare 4077
Pretty 4076
Phoenix 4067
causing 4067
twisted 4064
google 4062
scenario 4060
solve 4058
Getting 4057
ignorant 4057
billion 4055
declared 4055
university 4055
Note 4054
ENTIRE 4053
CCP 4051
Absolutely 4041
affect 4040
greatest 4040
passengers 4038
3100 4037
Number 4037
Blue 4035
spoken 4035
discovered 4034
Orlando 4031
IPS 4030
unable 4027
Amazon 4025
advisor 4024
pregnant 4023
EDUCATION 4020
court 4018
millionaires 4010
700 4006
CARES 4006
reopens 4006
direct 4005
Team 4004
bunch 4003
visitors 4001
Start 3998
Wales 3997
Vietnam 3995
requires 3993
Food 3991
youd 3991
remind 3990
worrying 3990
Britain 3989
@drsimonegold 3988
park 3982
looked 3981
shares 3981
disney 3977
grandson 3977
pubs 3976
Premier 3975
shields 3975
honest 3972
distract 3970
present 3968
revealed 3967
treatments 3967
retail 3966
Unfortunately 3963
Professor 3962
shoot 3961
900 3960
@Lrihendry 3959
GOING 3959
01 3956
secret 3955
@bigdaddyvinz 3951
table 3951
570K 3950
scam 3950
Reports 3949
deliver 3948
Adam 3946
Company 3945
Online 3945
tools 3945
Detroit 3943
ignorance 3941
CHILD 3939
districts 3939
Orange 3938
Aishwarya 3937
NSW 3934
insanity 3933
throw 3931
delayed 3930
goddamn 3925
aka 3923
teach 3923
#mask 3922
Latest 3920
predicted 3920
feed 3919
releasing 3918
cash 3916
analysis 3915
domestic 3914
gatherings 3914
kicking 3914
unlike 3914
Officer 3913
arizona 3913
Disneyland 3912
obviously 3908
wondering 3908
sister 3907
NJ 3906
135000 3905
Blows 3905
LIKE 3902
battling 3902
considered 3902
changing 3901
Okay 3900
email 3898
Thru 3897
Tomorrow 3896
drink 3891
@atrupar 3890
professionals 3889
Son 3888
@nytopinion 3887
Johns 3886
800 3884
fool 3881
spoke 3880
excited 3879
incredibly 3879
inflated 3878
Jr 3876
regularly 3876
Summer 3875
launched 3874
warriors 3874
trouble 3873
slogan 3871
asia 3869
issued 3868
HOME 3865
Young 3864
appreciate 3863
Red 3862
trace 3862
Youve 3857
pneumonia 3850
diseases 3847
Dept 3845
confused 3843
#florida 3842
entry 3836
products 3833
born 3832
dismissed 3832
Frontline 3831
kicked 3830
my 3829
elected 3827
Denmark 3824
through 3824
DEADLY 3822
wide 3822
blames 3818
80% 3814
Highest 3814
denied 3814
longterm 3812
priority 3811
FT 3810
82 3806
Key 3802
OMG 3802
@BaileyCarlin 3801
Coronaviruses 3801
Safe 3801
coffee 3801
@SkyNews 3798
BANS 3798
reply 3798
Centre 3797
destroying 3797
throwing 3797
dropped 3794
99 3793
OK 3792
decline 3792
KIDS 3787
Service 3786
suffer 3781
Internal 3780
FUCK 3778
@Public_Citizen 3776
rapid 3775
HUGE 3774
HELP 3773
With 3773
drinking 3773
sucks 3773
0 3771
unprecedented 3771
Teletracking 3768
ELECTION 3767
soft 3766
surprise 3764
usual 3763
@felipeneto 3757
@rickychavez68 3757
rawstory.com 3757
road 3756
@JuddLegum 3753
crap 3752
fixed 3752
winter 3752
fault 3751
laws 3750
Council 3746
about 3746
wonderful 3744
centers 3741
shortage 3740
housing 3739
na 3739
Morgues 3738
Shame 3738
Who 3737
protected 3737
upset 3736
MADE 3735
art 3735
explains 3734
dog 3730
id 3729
Nursing 3728
flights 3727
theme 3727
tragic 3727
Recovered 3726
2.016K 3725
lungs 3725
True 3724
Fall 3722
beach 3719
attacked 3718
120 3715
cast 3714
counted 3714
@catturd2 3713
heads 3712
contained 3707
killer 3706
approval 3704
combat 3703
maskwearing 3703
Law 3699
mascara 3698
Looks 3696
discourse 3696
importance 3696
67 3695
cells 3695
ground 3695
donald 3690
eye 3690
pandemics 3688
trade 3688
Put 3686
pediatric 3686
gathering 3685
hundred 3685
badly 3684
Alabama 3683
laid 3682
depressing 3680
hazard 3679
humanity 3678
Mary 3672
presidents 3671
prepare 3670
2300 3669
60% 3669
#indiafightscorona 3668
implement 3665
purpose 3665
Park 3664
hospitalization 3664
Always 3663
confirm 3663
Truth 3662
Stage 3661
moms 3660
threatening 3660
chart 3659
august 3654
Communist 3653
nonsense 3653
researchers 3653
bread 3651
dipshit 3651
therapy 3651
land 3649
camp 3647
containing 3647
@DeAnna4Congress 3644
volunteers 3644
Blasio 3643
amidst 3642
quit 3642
ventilator 3641
99% 3640
Damn 3640
Vaccines 3638
Lord 3637
votes 3637
carved 3636
maintain 3636
field 3635
quarantining 3635
@BorisJohnson 3634
california 3634
film 3633
victim 3633
@TheRickWilson 3629
sets 3629
@politvidchannel 3626
interest 3626
nature 3625
Active 3620
@HRDMinistry 3616
grateful 3615
outdoors 3614
debt 3613
turning 3612
Community 3611
Little 3611
Nations 3610
Rally 3610
canada 3609
trump2020 3609
Evidence 3608
unfortunately 3598
yr 3595
angry 3594
gym 3592
celebrate 3591
dear 3591
train 3590
ive 3587
repeat 3587
rn 3585
wed 3585
arrows 3583
10% 3582
destroyed 3581
German 3579
International 3579
parts 3579
King 3578
@robertspeker 3576
mandated 3576
biden 3575
135000000000 3573
individual 3573
times* 3572
*three 3570
recreating 3570
views 3567
Less 3566
owned 3566
Harris 3561
Bank 3560
YOU 3560
alcohol 3556
stability 3554
Friends 3552
facemask 3552
Bobby 3551
Contact 3550
elections 3549
GDP 3547
stupidity 3544
surgical 3539
against 3536
38 3534
charging 3533
cuts 3532
@keithboykin 3531
Will 3531
Organization 3529
Seoul 3528
defining 3528
Kentucky 3527
Local 3525
enjoying 3524
whilst 3524
migrant 3523
discussion 3522
Irish 3520
This 3520
grade 3519
2000 3517
None 3517
@BriannaNHolt 3516
scandal 3515
Spanish 3514
airport 3513
laugh 3506
lowest 3502
banning 3501
contagious 3500
Worth 3499
failing 3497
saliva 3496
Abbott 3494
Sure 3494
frustrate 3494
20% 3490
TIRED 3490
tip 3488
@Craig_A_Spencer 3487
dime 3487
FAKE 3486
Wall 3485
raising 3485
Isnt 3484
informed 3483
lived 3483
@RepSwalwell 3482
interested 3482
politicization 3482
value 3482
wounded 3481
universities 3477
hoping 3476
Guys 3475
Jesus 3474
Herd 3468
overnight 3468
brings 3458
crowd 3455
enemy 3453
foreign 3452
star 3452
session 3451
YouTube 3447
amitabh 3446
tens 3445
central 3443
covered 3443
NFL 3442
50M 3441
Quarantined 3441
drove 3441
gain 3441
panel 3441
boss 3440
40% 3439
CHINA 3439
fees 3439
Much 3438
protesters 3438
Story 3435
positives 3434
urgent 3429
alert 3428
harm 3425
YOURE 3424
JEE 3423
MEDIA 3423
PLAN 3423
remdesivir 3421
42 3419
MP 3418
Institute 3416
criminals 3413
department 3413
@Ngu_Spesh 3410
Sounds 3410
GETS 3409
Chicago 3408
Made 3408
wanting 3404
1.2K 3402
informing 3402
player 3402
2.018K 3401
canceled 3400
@RepMaxineWaters 3398
wild 3396
@WannaBeReeceJr 3395
extended 3394
TAYLOR 3393
vacation 3393
Brazilian 3392
Koreans 3391
Kollywood 3390
MISS 3390
shouldve 3390
civil 3386
Larry 3385
Thousands 3385
journalists 3385
@KeishaBottoms 3384
Seems 3384
epidemiologist 3384
winning 3383
Caught 3381
Medicare 3380
36 3378
French 3377
activities 3372
Yep 3371
trending 3371
Fact 3369
target 3369
adviser 3366
headlines 3365
markets 3362
Maryland 3360
TESTING 3360
plandemic 3359
threatened 3358
declaring 3357
YOUR 3356
#COVIDIOTS 3355
Hanks 3355
NEED 3355
fail 3352
Cannon 3351
sounds 3351
Pakistan 3350
superintendent 3349
MAKE 3348
arrangement 3347
Hillary 3346
Air 3342
quality 3342
Days 3340
regulations 3338
Mass 3337
Release 3337
watched 3337
Immunity 3336
placed 3336
Economy 3335
Interviews 3333
degree 3333
droplets 3333
natural 3331
Overflow 3330
primary 3330
suspended 3330
BARC 3329
urge 3329
@SaraCarterDC 3327
uncle 3327
americas 3326
Forcing 3325
Welcome 3321
hrs 3321
trans 3321
343 3320
factor 3320
Official 3315
cleaning 3314
authority 3308
pathetic 3308
completed 3307
usually 3307
equal 3306
briefed 3304
ran 3304
CUSTOMER 3301
movement 3301
hired 3299
republicans 3299
Surge 3298
disgrace 3295
unions 3290
RIGHT 3289
abroad 3288
Group 3287
sheep 3287
37 3285
obstacle 3285
yelled 3284
younger 3281
Pls 3280
continuing 3280
AM 3279
praise 3278
toilet 3277
Safety 3273
built 3273
polls 3273
AK47 3271
duty 3268
Dakota 3267
Send 3265
owner 3264
NC 3263
Oxfords 3263
SWIFT 3260
careful 3258
preventing 3256
District 3253
powerful 3252
Kashmir 3251
falling 3251
16th 3248
countrys 3248
1% 3247
vital 3243
tho 3242
@bathbodyworks 3239
Five 3236
intentionally 3234
encouraging 3233
challenging 3232
fan 3232
Game 3231
Aries 3230
surplus 3230
Blame 3229
discharged 3228
Hopkins 3227
colleagues 3224
youth 3221
Better 3220
End 3217
@itspaola_yoo 3216
station 3216
Idk 3214
creating 3214
Strips 3213
Tonight 3213
region 3213
requirement 3213
25% 3212
promising 3211
forces 3210
awareness 3209
moron 3209
@SakotaDage 3208
schedule 3207
Chinas 3205
suppressed 3205
Ben 3200
Illinois 3200
Lady 3195
Trust 3195
petition 3195
GOOD 3194
Maxwell 3192
PCR 3192
devastating 3189
evening 3189
Yorks 3186
developing 3185
suddenly 3185
surpassed 3185
Leader 3183
Leadership 3183
Jordan 3182
Club 3181
Digital 3180
utm_content 3180
#maskup 3179
Barr 3179
Went 3179
speed 3179
Lanez 3178
assume 3178
137000 3177
impacts 3177
hotspot 3174
smarter 3174
ordering 3172
Trudeau 3170
Worldometers 3169
Everything 3166
False 3166
accused 3160
familiar 3159
wartime 3159
holds 3158
mandating 3158
Didnt 3156
pics 3155
funded 3153
grandmother 3153
FAUCI 3150
Dan 3148
IN 3147
46 3146
symptom 3145
#china 3143
but 3143
Using 3142
shutting 3142
leaves 3140
Results 3139
Andrews 3134
anybody 3134
ON 3132
Theyve 3132
Unless 3129
peace 3128
drills 3127
cross 3126
aug 3124
motivation 3124
pre 3124
surrendered 3124
19M 3123
planned 3122
adding 3120
mixing 3120
@MommyFourBoys 3118
Not 3118
WTF 3118
green 3113
wealth 3113
Job 3112
MPs 3110
acknowledges 3109
kong 3109
Canadians 3108
magic 3107
fourth 3106
Reality 3101
begins 3099
Keeping 3098
#quarantine 3095
Bye 3095
Via 3095
jump 3094
@DC_Draino 3093
Us 3093
10x 3092
Epidemiologist 3091
mf 3090
speaks 3089
8000 3088
Officials 3088
owners 3088
entertainment 3083
guilty 3083
italy 3080
intelligence 3077
voter 3073
Richard 3072
Project 3068
prices 3068
Serious 3067
explosion 3065
classrooms 3064
@business 3063
Dead 3063
Morning 3063
Refuse 3063
mainstream 3063
prevention 3063
commercial 3062
READ 3061
rapidly 3061
endless 3060
impeached 3058
TODAY 3057
shooter 3057
Admits 3056
threatens 3056
@maddow 3055
spin 3055
base 3052
purposely 3048
hr 3045
limits 3045
sold 3043
LIFE 3042
flees 3041
#hydroxychloroquine 3040
facemasks 3040
demands 3036
what 3033
brave 3032
spiking 3029
@PATreasurer 3028
Bringing 3025
otherwise 3025
prevented 3023
preventable 3022
offering 3020
wellbeing 3020
@StevenTDennis 3018
Yorkers 3018
lifts 3017
wall 3017
code 3016
fox 3016
taxpayer 3016
Jeff 3015
hole 3014
responses 3014
recommendations 3013
10th 3011
Lab 3011
basis 3011
bbc.co.uk 3011
HUMAN 3010
distanced 3010
Guess 3008
@D_1andOnly_ 3007
Critical 3006
71 3002
Patient 3002
@DonaldJTrumpJr 2998
@marcant96 2998
Can 2997
persons 2996
survived 2996
Chart 2995
hi 2995
increases 2994
inform 2993
Fight 2992
liberal 2992
neither 2991
THIS 2988
Folks 2987
Committee 2984
MF 2983
physician 2983
overwhelmed 2982
raised 2982
flattening 2981
eliminated 2980
fewer 2980
23rd 2979
desperately 2979
filled 2979
@CNNPolitics 2978
We 2978
tourism 2976
faster 2973
U 2972
east 2971
cbsn.ws 2970
hadnt 2969
@RealMattCouch 2968
fed 2968
included 2967
ANC 2966
Australian 2963
bills 2963
gall 2963
kits 2963
Women 2962
boost 2962
@Mikel_Jollett 2961
LET 2960
morons 2960
covidYears 2958
Dominic 2957
desire 2957
irresponsible 2956
just 2956
Amazing 2954
unmarked 2954
bake 2953
brown 2953
rises 2953
repeatedly 2951
Families 2950
English 2949
Taking 2949
TESTED 2947
doors 2947
staggering 2947
Muslim 2946
answers 2945
200000 2943
STRIKE 2943
Wisconsin 2943
Governments 2942
bans 2942
entering 2942
guarantee 2942
ableds 2941
its 2941
wapo.st 2941
row 2940
@GeorgeTakei 2938
Sending 2938
network 2936
@RichardGrenell 2935
chances 2935
Niro 2934
transmit 2934
Asia 2931
#news 2930
Something 2930
DM 2926
Scott 2926
Turkey 2925
tender 2925
@jeremiahcota 2923
Plus 2923
CoviD 2922
weak 2921
@charliekirk11 2920
remotely 2920
roll 2920
EVER 2919
Liberty 2917
collection 2917
isolated 2917
useful 2917
comply 2914
knowledge 2913
fatalities 2912
verified 2911
expensive 2910
50000 2908
decades 2908
outdoor 2908
Floyd 2907
Faucis 2903
cautiousness 2903
particularly 2902
priorities 2902
standstill 2902
2100 2898
ICUs 2897
@PeterStefanovi2 2893
Die 2893
citing 2893
So 2892
Colorado 2891
passes 2891
platform 2891
Woman 2889
controlling 2888
Vinay 2886
donated 2885
160 2884
Outbreak 2882
fails 2882
kinda 2882
joe 2881
immediate 2880
recommend 2880
REALLY 2879
excellent 2878
meetings 2878
prisons 2878
appear 2876
Network 2874
ocid 2873
Four 2872
UN 2871
@govkristinoem 2870
gyms 2869
@realTuckFrumper 2868
arrived 2865
workfromhome 2865
@MattHancock 2861
Tracking 2860
FOX 2858
lesson 2858
yrs 2858
Goya 2857
Honestly 2853
affects 2853
barely 2851
snatch 2851
#india 2848
relatives 2848
74 2847
parent 2847
VP 2846
extreme 2846
Toronto 2845
uses 2845
Karens 2844
WANT 2844
instagram.com 2841
refusal 2841
solutions 2841
Share 2840
heartbeat 2840
partying 2840
zone 2838
professor 2837
seniors 2837
produce 2836
Sturgeon 2835
accosted 2834
north 2833
returned 2833
3% 2831
Congratulations 2831
ironic 2831
tour 2831
independent 2828
justification 2826
unnecessary 2826
#stayathome 2825
League 2825
@TONYxTWO 2824
crying 2823
abt 2822
Aberdeen 2819
@Laurie_Garrett 2818
BMC 2818
designed 2818
behavior 2817
violating 2816
regardless 2815
ultrasound 2815
Grubhub 2813
lasting 2813
solidarity 2813
trains 2812
Countries 2811
KEMP 2811
boycott 2811
mentioned 2810
mo 2809
Praying 2808
Voted 2808
historic 2808
innovative 2808
SC 2807
horrifying 2807
incredible 2807
suicide 2806
49 2805
Convention 2805
